app/controllers/users_controller.rb

INSERT INTO "users" ("name", "mail", "birth_date", "tel", "return_rate", "recommendation_rate", "suggestions", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT  "bonus_codes".* FROM "bonus_codes"  ORDER BY "bonus_codes"."id" ASC LIMIT 1
UPDATE "bonus_codes" SET "code" = $1, "updated_at" = $2 WHERE "bonus_codes"."id" = $3  [["code", 2], ["updated_at", "2016-06-03 22:13:43.961344"], ["id", 1]]
---
  def create
    @user = User.new(user_params)
    if @user.save
      bonus_code = BonusCode.first
      body = 'PAT' + bonus_code.code.to_s
      users_to_report = [@user.mail]
      ApplicationMailer.patagonia_bonus(users_to_report, body, 'Bar Patagonia').deliver_now!
      bonus_code.code += 1
      bonus_code.save

UPDATE "users" SET "mail" = $1, "recommendation_rate" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["mail", "lburgos@fsdf.ombb9"], ["recommendation_rate", 2], ["updated_at", "2016-05-30 11:33:59.822085"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)